/* 
SOLID

S - single responsibolity - функция отвечает только за одно
O - open–closed - 
L - liskov substitution - 
I - interface segregation - 
D - dependency inversion - 

Массовые принципы!

*/

// У каждого метода делаем описание, что делает, что ещет, что в нем
//int GetNumberFromConsole(int q, string); - методы называем глаголами, не более чем 5 словами и предавать в метод не более 5 аргументов
// Если больше 5 то создаем классы
// каждый класс и фунтция должен делать только одну вещь!!!
// Размер написанных методов должен умещаться на экране

// Строим на абстракции, строим архитектуру

// Не усложняем код! Так что понял самый недалекий человек

// https://www.chitai-gorod.ru/product/master-klass-sovershennyy-kod-2047176 - прочитать книгу

